{
  "backend/main.mo": "Defines a canister storing CaseRecord entries in a Map and exposes addRecord and getAllRecords functions.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and requirement IDs for QR and deployment functionality.",
  "frontend-file-summaries.txt": "Contains prewritten one-line summaries for major frontend files including features, hooks, utilities, and config.",
  "frontend/DEPLOYMENT.md": "Explains how to obtain and share the live deployment URL and how to test QR code generation and scanning.",
  "frontend/index.css": "Tailwind-based global styling with OKLCH color variables supporting light and dark themes.",
  "frontend/index.html": "Minimal HTML entry file that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component toggling between LoginPage and DashboardPage based on authentication state.",
  "frontend/src/backend/backend.did.js": "Defines Candid interface for the backend canister including addRecord and getAllRecords.",
  "frontend/src/backend/index.ts": "Provides createActor utility for initializing the backend canister actor with HttpAgent options.",
  "frontend/src/features/auth/LoginPage.tsx": "Login form validating fixed credentials and displaying UI feedback via shadcn/ui components.",
  "frontend/src/features/cases/caseQueries.ts": "React Query hooks for fetching and adding case records using the backend actor.",
  "frontend/src/features/cases/RecordedCasesTable.tsx": "Renders sortable case records table with CSV export capability.",
  "frontend/src/features/dashboard/DashboardPage.tsx": "Main dashboard combining manual notes, QR scanner card, live link copy, and case records table.",
  "frontend/src/features/dashboard/ScannerCard.tsx": "Camera-based QR scanner and manual entry form that parses QR payloads, autofills fields, and can generate QR codes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file kept for project structure consistency.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/csv.ts": "Exports case records to a downloadable CSV file with proper value escaping and sorting.",
  "frontend/src/lib/liveLink.ts": "Provides utilities to get the current site URL and copy text to the clipboard with fallbacks.",
  "frontend/src/lib/qrGenerator.ts": "Loads a QR code generator library from CDN and produces QR code SVG strings.",
  "frontend/src/lib/qrPayload.ts": "Encodes and decodes QR payloads in a pipe-delimited Name|Case|Crime|Date format.",
  "frontend/src/lib/sfx.ts": "Plays a cached beep sound, cloning audio nodes to allow rapid repeats.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and enabling plugins.",
  "project_state.json": "Defines the project’s version, goals, architectural notes, existing features, and known issues for building a browser‑based CJM Case Management System. Serves as a centralized specification for current functionality and implementation guidelines."
}